prestonbrown/helixscreen/firmware/ktouch-probe/sdkconfig.defaults
# BTT K-Touch: ESP32-S3R8 (8MB octal PSRAM), 16MB quad flash
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Flash: GigaDevice quad, stock firmware ships DOUT@80MHz — stay conservative
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Octal PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# RGB panel framebuffer lives in PSRAM; allow DMA descriptors in internal RAM
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

CONFIG_FREERTOS_HZ=1000
